// export const marketlog= '
//   <맡은 부분>
//   1. 마이페이지의 개인정보수정 페이지 구현
//   - 마이페이지에 진입할 때 마다 localStorage에 accessToken이 있는지 확인하고, 있을 때만 진입 가능하게 구현했습니다.
//   - 개인 정보 수정 페이지에 진입할 때, 바로 진입 가능한 것이 아니라, 사용자에게 비밀번호를 다시 한 번 입력하게 함으로써 보안을 좀 더 신경썼고, 비밀번호가 맞는지 판별하는 기능은 로그인 API를 통해 구현했습니다.
//   - 삼항연산자, && 연산자, || 연산자를 통해 조건문을 만들어 각 input창마다 유효성 검사 기능을 넣었습니다.
//   2. 헤더, 푸터 구현
//   - 규모가 크지 않은 사이트는 대부분 검색창을 통한 서치보다, 카테고리에서 선택해서 물품을 찾는 경우가 많다는 특성을 생각해서, 처음에는 서치바가 접혀있는 상태로 있다가, 사용시에만 펼쳐질 수 있도록 구현했습니다.
//   3. 사이트의 전체적인 퍼블리싱 담당
//   - 각자 다르게 쓴 코드에서 겹치는 기능은 제거하고, 스타일을 통일성 있게 변경해주었습니다.

//   <프로젝트를 하면서 어려웠던/힘들었던 점과 해결 방식>
//   1. 팀원들의 의견 불일치를 통한 갈등이 있었다. 각자 맞는 말을 했고, 그저 다른 뿐인 의견인데, 이로 인해 갈등이 생겨 중재를 했습니다.
// '
